#ifndef PENDANT_READER_H
#define PENDANT_READER_H

/* Generated by flatcc 0.6.2 FlatBuffers schema compiler for C by dvide.com */

#ifndef FLATBUFFERS_COMMON_READER_H
#include "flatbuffers_common_reader.h"
#endif
#include "flatcc/flatcc_flatbuffers.h"
#ifndef __alignas_is_defined
#include <stdalign.h>
#endif
#include "flatcc/flatcc_prologue.h"
#ifndef flatbuffers_identifier
#define flatbuffers_identifier 0
#endif
#ifndef flatbuffers_extension
#define flatbuffers_extension "bin"
#endif

typedef struct Pendant_v2_PktHeader Pendant_v2_PktHeader_t;
typedef const Pendant_v2_PktHeader_t *Pendant_v2_PktHeader_struct_t;
typedef Pendant_v2_PktHeader_t *Pendant_v2_PktHeader_mutable_struct_t;
typedef const Pendant_v2_PktHeader_t *Pendant_v2_PktHeader_vec_t;
typedef Pendant_v2_PktHeader_t *Pendant_v2_PktHeader_mutable_vec_t;
typedef struct Pendant_v2_Pkt Pendant_v2_Pkt_t;
typedef const Pendant_v2_Pkt_t *Pendant_v2_Pkt_struct_t;
typedef Pendant_v2_Pkt_t *Pendant_v2_Pkt_mutable_struct_t;
typedef const Pendant_v2_Pkt_t *Pendant_v2_Pkt_vec_t;
typedef Pendant_v2_Pkt_t *Pendant_v2_Pkt_mutable_vec_t;
typedef struct Pendant_v2_MultiPartPktAdditionalHeader Pendant_v2_MultiPartPktAdditionalHeader_t;
typedef const Pendant_v2_MultiPartPktAdditionalHeader_t *Pendant_v2_MultiPartPktAdditionalHeader_struct_t;
typedef Pendant_v2_MultiPartPktAdditionalHeader_t *Pendant_v2_MultiPartPktAdditionalHeader_mutable_struct_t;

    case Pendant_v2_HIDCommandValueID_get_magkey_config: return "get_magkey_config";
    case Pendant_v2_HIDCommandValueID_set_magkey_config: return "set_magkey_config";
    case Pendant_v2_HIDCommandValueID_get_trackball_connected: return "get_trackball_connected";
    default: return "";
    }
}

static inline int Pendant_v2_HIDCommandValueID_is_known_value(Pendant_v2_HIDCommandValueID_enum_t value)
{
    switch (value) {
    case Pendant_v2_HIDCommandValueID_START: return 1;
    case Pendant_v2_HIDCommandValueID_get_fw_version: return 1;
    case Pendant_v2_HIDCommandValueID_get_device_list: return 1;
    case Pendant_v2_HIDCommandValueID_update_i2c_address: return 1;
    case Pendant_v2_HIDCommandValueID_rescan_i2c_devices: return 1;
    case Pendant_v2_HIDCommandValueID_reset_all_params: return 1;
    case Pendant_v2_HIDCommandValueID_set_display_keypress_target: return 1;
    case Pendant_v2_HIDCommandValueID_get_keypress: return 1;
    case Pendant_v2_HIDCommandValueID_get_magkey_config: return 1;
    case Pendant_v2_HIDCommandValueID_set_magkey_config: return 1;
    case Pendant_v2_HIDCommandValueID_get_trackball_connected: return 1;
    default: return 0;
    }
}

typedef uint8_t Pendant_v2_SetI2CAddrCmdErrorCode_enum_t;
__flatbuffers_define_integer_type(Pendant_v2_SetI2CAddrCmdErrorCode, Pendant_v2_SetI2CAddrCmdErrorCode_enum_t, 8)
#define Pendant_v2_SetI2CAddrCmdErrorCode_SUCCESS ((Pendant_v2_SetI2CAddrCmdErrorCode_enum_t)UINT8_C(0))
#define Pendant_v2_SetI2CAddrCmdErrorCode_ADDRESS_UNCHANGED ((Pendant_v2_SetI2CAddrCmdErrorCode_enum_t)UINT8_C(1))
#define Pendant_v2_SetI2CAddrCmdErrorCode_INVALID_NEW_ADDRESS ((Pendant_v2_SetI2CAddrCmdErrorCode_enum_t)UINT8_C(2))
#define Pendant_v2_SetI2CAddrCmdErrorCode_ALREADY_IN_USE ((Pendant_v2_SetI2CAddrCmdErrorCode_enum_t)UINT8_C(3))
#define Pendant_v2_SetI2CAddrCmdErrorCode_WRITE_FAILED ((Pendant_v2_SetI2CAddrCmdErrorCode_enum_t)UINT8_C(4))

static inline const char *Pendant_v2_SetI2CAddrCmdErrorCode_name(Pendant_v2_SetI2CAddrCmdErrorCode_enum_t value)
{
    switch (value) {
    case Pendant_v2_SetI2CAddrCmdErrorCode_SUCCESS: return "SUCCESS";
    case Pendant_v2_SetI2CAddrCmdErrorCode_ADDRESS_UNCHANGED: return "ADDRESS_UNCHANGED";
    case Pendant_v2_SetI2CAddrCmdErrorCode_INVALID_NEW_ADDRESS: return "INVALID_NEW_ADDRESS";
    case Pendant_v2_SetI2CAddrCmdErrorCode_ALREADY_IN_USE: return "ALREADY_IN_USE";
    case Pendant_v2_SetI2CAddrCmdErrorCode_WRITE_FAILED: return "WRITE_FAILED";
    default: return "";
    }
}

static inline int Pendant_v2_SetI2CAddrCmdErrorCode_is_known_value(Pendant_v2_SetI2CAddrCmdErrorCode_enum_t value)
{
    switch (value) {
    case Pendant_v2_SetI2CAddrCmdErrorCode_SUCCESS: return 1;
    case Pendant_v2_SetI2CAddrCmdErrorCode_ADDRESS_UNCHANGED: return 1;
    case Pendant_v2_SetI2CAddrCmdErrorCode_INVALID_NEW_ADDRESS: return 1;
    case Pendant_v2_SetI2CAddrCmdErrorCode_ALREADY_IN_USE: return 1;
    case Pendant_v2_SetI2CAddrCmdErrorCode_WRITE_FAILED: return 1;
    default: return 0;
    }
}


struct Pendant_v2_PktHeader {
    alignas(1) uint8_t command_id;
    alignas(1) uint8_t channel_id;
    alignas(1) uint8_t seq;
    alignas(1) uint8_t value_id;
    alignas(1) uint8_t data_length;
};
static_assert(sizeof(Pendant_v2_PktHeader_t) == 5, "struct size mismatch");

static inline const Pendant_v2_PktHeader_t *Pendant_v2_PktHeader__const_ptr_add(const Pendant_v2_PktHeader_t *p, size_t i) { return p + i; }
static inline Pendant_v2_PktHeader_t *Pendant_v2_PktHeader__ptr_add(Pendant_v2_PktHeader_t *p, size_t i) { return p + i; }
static inline Pendant_v2_PktHeader_struct_t Pendant_v2_PktHeader_vec_at(Pendant_v2_PktHeader_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_PktHeader__size(void) { return 5; }
static inline size_t Pendant_v2_PktHeader_vec_len(Pendant_v2_PktHeader_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_PktHeader)

__flatbuffers_define_struct_scalar_field(Pendant_v2_PktHeader, command_id, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_PktHeader, channel_id, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_PktHeader, seq, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_PktHeader, value_id, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_PktHeader, data_length, flatbuffers_uint8, uint8_t)

struct Pendant_v2_Pkt {
    alignas(1) Pendant_v2_PktHeader_t headers;
    alignas(1) uint8_t data[27];
};
static_assert(sizeof(Pendant_v2_Pkt_t) == 32, "struct size mismatch");

static inline const Pendant_v2_Pkt_t *Pendant_v2_Pkt__const_ptr_add(const Pendant_v2_Pkt_t *p, size_t i) { return p + i; }
static inline Pendant_v2_Pkt_t *Pendant_v2_Pkt__ptr_add(Pendant_v2_Pkt_t *p, size_t i) { return p + i; }
static inline Pendant_v2_Pkt_struct_t Pendant_v2_Pkt_vec_at(Pendant_v2_Pkt_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_Pkt__size(void) { return 32; }
static inline size_t Pendant_v2_Pkt_vec_len(Pendant_v2_Pkt_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_Pkt)

__flatbuffers_define_struct_struct_field(Pendant_v2_Pkt, headers, Pendant_v2_PktHeader_struct_t)
__flatbuffers_define_struct_scalar_fixed_array_field(Pendant_v2_Pkt, data, flatbuffers_uint8, uint8_t, 27)

struct Pendant_v2_MultiPartPktAdditionalHeader {
    alignas(1) uint8_t part;
    alignas(1) uint8_t total_parts;
};
static_assert(sizeof(Pendant_v2_MultiPartPktAdditionalHeader_t) == 2, "struct size mismatch");

static inline const Pendant_v2_MultiPartPktAdditionalHeader_t *Pendant_v2_MultiPartPktAdditionalHeader__const_ptr_add(const Pendant_v2_MultiPartPktAdditionalHeader_t *p, size_t i) { return p + i; }
static inline Pendant_v2_MultiPartPktAdditionalHeader_t *Pendant_v2_MultiPartPktAdditionalHeader__ptr_add(Pendant_v2_MultiPartPktAdditionalHeader_t *p, size_t i) { return p + i; }
static inline Pendant_v2_MultiPartPktAdditionalHeader_struct_t Pendant_v2_MultiPartPktAdditionalHeader_vec_at(Pendant_v2_MultiPartPktAdditionalHeader_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_MultiPartPktAdditionalHeader__size(void) { return 2; }
static inline size_t Pendant_v2_MultiPartPktAdditionalHeader_vec_len(Pendant_v2_MultiPartPktAdditionalHeader_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_MultiPartPktAdditionalHeader)

__flatbuffers_define_struct_scalar_field(Pendant_v2_MultiPartPktAdditionalHeader, part, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_MultiPartPktAdditionalHeader, total_parts, flatbuffers_uint8, uint8_t)

struct Pendant_v2_MultiPartPkt {
    alignas(1) Pendant_v2_PktHeader_t headers;
    alignas(1) Pendant_v2_MultiPartPktAdditionalHeader_t additional_headers;
    alignas(1) uint8_t data[25];
};
static_assert(sizeof(Pendant_v2_MultiPartPkt_t) == 32, "struct size mismatch");

static inline const Pendant_v2_MultiPartPkt_t *Pendant_v2_MultiPartPkt__const_ptr_add(const Pendant_v2_MultiPartPkt_t *p, size_t i) { return p + i; }
static inline Pendant_v2_MultiPartPkt_t *Pendant_v2_MultiPartPkt__ptr_add(Pendant_v2_MultiPartPkt_t *p, size_t i) { return p + i; }
static inline Pendant_v2_MultiPartPkt_struct_t Pendant_v2_MultiPartPkt_vec_at(Pendant_v2_MultiPartPkt_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_MultiPartPkt__size(void) { return 32; }
static inline size_t Pendant_v2_MultiPartPkt_vec_len(Pendant_v2_MultiPartPkt_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_MultiPartPkt)

__flatbuffers_define_struct_struct_field(Pendant_v2_MultiPartPkt, headers, Pendant_v2_PktHeader_struct_t)
__flatbuffers_define_struct_struct_field(Pendant_v2_MultiPartPkt, additional_headers, Pendant_v2_MultiPartPktAdditionalHeader_struct_t)
__flatbuffers_define_struct_scalar_fixed_array_field(Pendant_v2_MultiPartPkt, data, flatbuffers_uint8, uint8_t, 25)

struct Pendant_v2_DeviceItem {
    alignas(8) uint8_t ch;
    alignas(1) uint8_t addr;
    alignas(1) Pendant_v2_ModuleType_enum_t type;
    alignas(1) uint8_t shift;
    alignas(8) uint64_t uid;
};
static_assert(sizeof(Pendant_v2_DeviceItem_t) == 16, "struct size mismatch");

static inline const Pendant_v2_DeviceItem_t *Pendant_v2_DeviceItem__const_ptr_add(const Pendant_v2_DeviceItem_t *p, size_t i) { return p + i; }
static inline Pendant_v2_DeviceItem_t *Pendant_v2_DeviceItem__ptr_add(Pendant_v2_DeviceItem_t *p, size_t i) { return p + i; }
static inline Pendant_v2_DeviceItem_struct_t Pendant_v2_DeviceItem_vec_at(Pendant_v2_DeviceItem_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_DeviceItem__size(void) { return 16; }
static inline size_t Pendant_v2_DeviceItem_vec_len(Pendant_v2_DeviceItem_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_DeviceItem)

__flatbuffers_define_struct_scalar_field(Pendant_v2_DeviceItem, ch, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_DeviceItem, addr, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_DeviceItem, type, Pendant_v2_ModuleType, Pendant_v2_ModuleType_enum_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_DeviceItem, shift, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_DeviceItem, uid, flatbuffers_uint64, uint64_t)

struct Pendant_v2_SetI2CAddrCmd {
    alignas(1) uint8_t ch;
    alignas(1) uint8_t old_addr;
    alignas(1) uint8_t new_addr;
};
static_assert(sizeof(Pendant_v2_SetI2CAddrCmd_t) == 3, "struct size mismatch");

static inline const Pendant_v2_SetI2CAddrCmd_t *Pendant_v2_SetI2CAddrCmd__const_ptr_add(const Pendant_v2_SetI2CAddrCmd_t *p, size_t i) { return p + i; }
static inline Pendant_v2_SetI2CAddrCmd_t *Pendant_v2_SetI2CAddrCmd__ptr_add(Pendant_v2_SetI2CAddrCmd_t *p, size_t i) { return p + i; }
static inline Pendant_v2_SetI2CAddrCmd_struct_t Pendant_v2_SetI2CAddrCmd_vec_at(Pendant_v2_SetI2CAddrCmd_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_SetI2CAddrCmd__size(void) { return 3; }
static inline size_t Pendant_v2_SetI2CAddrCmd_vec_len(Pendant_v2_SetI2CAddrCmd_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_SetI2CAddrCmd)

__flatbuffers_define_struct_scalar_field(Pendant_v2_SetI2CAddrCmd, ch, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_SetI2CAddrCmd, old_addr, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_SetI2CAddrCmd, new_addr, flatbuffers_uint8, uint8_t)

struct Pendant_v2_SetI2CAddrCmdResponse {
    alignas(1) flatbuffers_bool_t success;
    alignas(1) Pendant_v2_SetI2CAddrCmdErrorCode_enum_t error_code;
};
static_assert(sizeof(Pendant_v2_SetI2CAddrCmdResponse_t) == 2, "struct size mismatch");

static inline const Pendant_v2_SetI2CAddrCmdResponse_t *Pendant_v2_SetI2CAddrCmdResponse__const_ptr_add(const Pendant_v2_SetI2CAddrCmdResponse_t *p, size_t i) { return p + i; }
static inline Pendant_v2_SetI2CAddrCmdResponse_t *Pendant_v2_SetI2CAddrCmdResponse__ptr_add(Pendant_v2_SetI2CAddrCmdResponse_t *p, size_t i) { return p + i; }
static inline Pendant_v2_SetI2CAddrCmdResponse_struct_t Pendant_v2_SetI2CAddrCmdResponse_vec_at(Pendant_v2_SetI2CAddrCmdResponse_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_SetI2CAddrCmdResponse__size(void) { return 2; }
static inline size_t Pendant_v2_SetI2CAddrCmdResponse_vec_len(Pendant_v2_SetI2CAddrCmdResponse_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_SetI2CAddrCmdResponse)

__flatbuffers_define_struct_scalar_field(Pendant_v2_SetI2CAddrCmdResponse, success, flatbuffers_bool, flatbuffers_bool_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_SetI2CAddrCmdResponse, error_code, Pendant_v2_SetI2CAddrCmdErrorCode, Pendant_v2_SetI2CAddrCmdErrorCode_enum_t)

struct Pendant_v2_GetKeypressCmd {
    alignas(1) uint8_t row;
    alignas(1) uint8_t col;
};
static_assert(sizeof(Pendant_v2_GetKeypressCmd_t) == 2, "struct size mismatch");

static inline const Pendant_v2_GetKeypressCmd_t *Pendant_v2_GetKeypressCmd__const_ptr_add(const Pendant_v2_GetKeypressCmd_t *p, size_t i) { return p + i; }
static inline Pendant_v2_GetKeypressCmd_t *Pendant_v2_GetKeypressCmd__ptr_add(Pendant_v2_GetKeypressCmd_t *p, size_t i) { return p + i; }
static inline Pendant_v2_GetKeypressCmd_struct_t Pendant_v2_GetKeypressCmd_vec_at(Pendant_v2_GetKeypressCmd_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_GetKeypressCmd__size(void) { return 2; }
static inline size_t Pendant_v2_GetKeypressCmd_vec_len(Pendant_v2_GetKeypressCmd_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_GetKeypressCmd)

__flatbuffers_define_struct_scalar_field(Pendant_v2_GetKeypressCmd, row, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_GetKeypressCmd, col, flatbuffers_uint8, uint8_t)

struct Pendant_v2_GetKeypressResponse {
    alignas(2) uint16_t value;
    alignas(1) flatbuffers_bool_t is_magkey;
};
static_assert(sizeof(Pendant_v2_GetKeypressResponse_t) == 4, "struct size mismatch");

static inline const Pendant_v2_GetKeypressResponse_t *Pendant_v2_GetKeypressResponse__const_ptr_add(const Pendant_v2_GetKeypressResponse_t *p, size_t i) { return p + i; }
static inline Pendant_v2_GetKeypressResponse_t *Pendant_v2_GetKeypressResponse__ptr_add(Pendant_v2_GetKeypressResponse_t *p, size_t i) { return p + i; }
static inline Pendant_v2_GetKeypressResponse_struct_t Pendant_v2_GetKeypressResponse_vec_at(Pendant_v2_GetKeypressResponse_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_GetKeypressResponse__size(void) { return 4; }
static inline size_t Pendant_v2_GetKeypressResponse_vec_len(Pendant_v2_GetKeypressResponse_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_GetKeypressResponse)

__flatbuffers_define_struct_scalar_field(Pendant_v2_GetKeypressResponse, value, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_GetKeypressResponse, is_magkey, flatbuffers_bool, flatbuffers_bool_t)

struct Pendant_v2_GetTrackballConnectedResponse {
    alignas(1) uint8_t count;
    alignas(1) uint8_t flags[4];
};
static_assert(sizeof(Pendant_v2_GetTrackballConnectedResponse_t) == 5, "struct size mismatch");

static inline const Pendant_v2_GetTrackballConnectedResponse_t *Pendant_v2_GetTrackballConnectedResponse__const_ptr_add(const Pendant_v2_GetTrackballConnectedResponse_t *p, size_t i) { return p + i; }
static inline Pendant_v2_GetTrackballConnectedResponse_t *Pendant_v2_GetTrackballConnectedResponse__ptr_add(Pendant_v2_GetTrackballConnectedResponse_t *p, size_t i) { return p + i; }
static inline Pendant_v2_GetTrackballConnectedResponse_struct_t Pendant_v2_GetTrackballConnectedResponse_vec_at(Pendant_v2_GetTrackballConnectedResponse_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_GetTrackballConnectedResponse__size(void) { return 5; }
static inline size_t Pendant_v2_GetTrackballConnectedResponse_vec_len(Pendant_v2_GetTrackballConnectedResponse_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_GetTrackballConnectedResponse)

__flatbuffers_define_struct_scalar_field(Pendant_v2_GetTrackballConnectedResponse, count, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_fixed_array_field(Pendant_v2_GetTrackballConnectedResponse, flags, flatbuffers_uint8, uint8_t, 4)

struct Pendant_v2_SetMagkeyConfigCmd {
    alignas(2) uint8_t row;
    alignas(1) uint8_t col;
    alignas(2) uint16_t actuation;
    alignas(2) uint16_t reset;
    alignas(1) flatbuffers_bool_t rapid_trigger_enable;
};
static_assert(sizeof(Pendant_v2_SetMagkeyConfigCmd_t) == 8, "struct size mismatch");

static inline const Pendant_v2_SetMagkeyConfigCmd_t *Pendant_v2_SetMagkeyConfigCmd__const_ptr_add(const Pendant_v2_SetMagkeyConfigCmd_t *p, size_t i) { return p + i; }
static inline Pendant_v2_SetMagkeyConfigCmd_t *Pendant_v2_SetMagkeyConfigCmd__ptr_add(Pendant_v2_SetMagkeyConfigCmd_t *p, size_t i) { return p + i; }
static inline Pendant_v2_SetMagkeyConfigCmd_struct_t Pendant_v2_SetMagkeyConfigCmd_vec_at(Pendant_v2_SetMagkeyConfigCmd_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_SetMagkeyConfigCmd__size(void) { return 8; }
static inline size_t Pendant_v2_SetMagkeyConfigCmd_vec_len(Pendant_v2_SetMagkeyConfigCmd_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_SetMagkeyConfigCmd)

__flatbuffers_define_struct_scalar_field(Pendant_v2_SetMagkeyConfigCmd, row, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_SetMagkeyConfigCmd, col, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_SetMagkeyConfigCmd, actuation, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_SetMagkeyConfigCmd, reset, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(Pendant_v2_SetMagkeyConfigCmd, rapid_trigger_enable, flatbuffers_bool, flatbuffers_bool_t)

struct Pendant_v2_SetDisplayKeypressTargetCmd {
    alignas(1) uint8_t keypress_row;
    alignas(1) uint8_t keypress_col;
};
static_assert(sizeof(Pendant_v2_SetDisplayKeypressTargetCmd_t) == 2, "struct size mismatch");

static inline const Pendant_v2_SetDisplayKeypressTargetCmd_t *Pendant_v2_SetDisplayKeypressTargetCmd__const_ptr_add(const Pendant_v2_SetDisplayKeypressTargetCmd_t *p, size_t i) { return p + i; }
static inline Pendant_v2_SetDisplayKeypressTargetCmd_t *Pendant_v2_SetDisplayKeypressTargetCmd__ptr_add(Pendant_v2_SetDisplayKeypressTargetCmd_t *p, size_t i) { return p + i; }
static inline Pendant_v2_SetDisplayKeypressTargetCmd_struct_t Pendant_v2_SetDisplayKeypressTargetCmd_vec_at(Pendant_v2_SetDisplayKeypressTargetCmd_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t Pendant_v2_SetDisplayKeypressTargetCmd__size(void) { return 2; }
static inline size_t Pendant_v2_SetDisplayKeypressTargetCmd_vec_len(Pendant_v2_SetDisplayKeypressTargetCmd_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(Pendant_v2_SetDisplayKeypressTargetCmd)

